Java-Basic/java-dateTime.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-02 Fri 06:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java DateTime API</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Java DateTime API</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0151864">1. Date/SimpleDateFormat</a></li>
<li><a href="#orga7cc4b2">2. Calender</a></li>
<li><a href="#org3497c45">3. JodaTime</a></li>
<li><a href="#orgd3afae4">4. LocalTime/LocalDate/LocalDateTime</a></li>
</ul>
</div>
</nav>




<section id="outline-container-org0151864" class="outline-2">
<h2 id="org0151864"><span class="section-number-2">1</span> Date/SimpleDateFormat</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Date</span> <span class="org-variable-name">now</span> = <span class="org-keyword">new</span> <span class="org-type">Date</span>();

<span class="org-type">DateFormat</span> <span class="org-variable-name">df</span> = <span class="org-keyword">new</span> <span class="org-type">SimpleDateFormat</span>(<span class="org-string">"yyyy-MM-dd hh:mm:ss"</span>);
<span class="org-type">String</span> <span class="org-variable-name">nowStr</span> = df.parse(now);

<span class="org-type">Date</span> <span class="org-variable-name">then</span> = df.format(<span class="org-string">"2001-12-31 11:33:44"</span>);
</pre>
</div>
</div>
</section>

<section id="outline-container-orga7cc4b2" class="outline-2">
<h2 id="orga7cc4b2"><span class="section-number-2">2</span> Calender</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">Calender</span> <span class="org-variable-name">c</span> = Calender.getInstance(); <span class="org-comment-delimiter">// </span><span class="org-comment">GregorianCalendar</span>
<span class="org-type">Calender</span> <span class="org-variable-name">c</span> = <span class="org-keyword">new</span> <span class="org-type">GregorianCalendar</span>();

<span class="org-type">Date</span> <span class="org-variable-name">d</span> = c.getTime();
</pre>
</div>
</div>
</section>

<section id="outline-container-org3497c45" class="outline-2">
<h2 id="org3497c45"><span class="section-number-2">3</span> JodaTime</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sgml"><span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">https://mvnrepository.com/artifact/joda-time/joda-time </span><span class="org-comment-delimiter">--&gt;</span>
&lt;<span class="org-function-name">dependency</span>&gt;
    &lt;<span class="org-function-name">groupId</span>&gt;joda-time&lt;/<span class="org-function-name">groupId</span>&gt;
    &lt;<span class="org-function-name">artifactId</span>&gt;joda-time&lt;/<span class="org-function-name">artifactId</span>&gt;
    &lt;<span class="org-function-name">version</span>&gt;2.10.1&lt;/<span class="org-function-name">version</span>&gt;
&lt;/<span class="org-function-name">dependency</span>&gt;
</pre>
</div>
</div>
</section>

<section id="outline-container-orgd3afae4" class="outline-2">
<h2 id="orgd3afae4"><span class="section-number-2">4</span> LocalTime/LocalDate/LocalDateTime</h2>
<div class="outline-text-2" id="text-4">
<p>
jdk8
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-02 Fri 06:37</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
